---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsWarning
source: html/38316bb9-1ccf-bf6f-5b24-79cb24424700.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsWarning Property

Changing the family for a MEP fitting might cause unexpected results.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnexpectedFamilyChangeResultsWarning { get; }
```